uhnp/src/InformationRegisters/ОбщиеНастройкиРаспознаваниеДокументов/ОбщиеНастройкиРаспознаваниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбщиеНастройкиРаспознаваниеДокументов</name>
  <resources>
    <name>ПоказыватьЭлементыНастройкиИнтерфейса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверятьЗамечанияПередСозданиемДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗадаватьВопросОСохраненииСоответствийДляРаспознанныхСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВариантСохраненияСоответствий</name>
    <type>
      <types>EnumRef.ВариантыСохраненияСоответствийБРД</types>
    </type>
  </resources>
  <resources>
    <name>ОткрыватьНовыеЭлементыСправочниковПослеСоздания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормаОбработчикаПоказыватьИзображенияВШапке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧастотаОтправкиВложенийИзПочтыНаРаспознавание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РаспознаватьВложенияИзПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочтаДляОбработкиВложений</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейОбработкиВложений</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РаспознаватьФайлыИзКаталога</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧастотаОтправкиФайловИзКаталогаНаРаспознавание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогДляОбработкиФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВключаяВложенныеКаталоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкладПоУмолчанию</name>
    <type>
      <types>DefinedType.СкладБРД</types>
    </type>
  </resources>
  <resources>
    <name>ПриОбнаруженииДокументаПрикреплятьИзображениеАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПомечатьДокументОбработаннымПриНайденномВБазе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СоздаватьСчетФактуруПриСозданииОснования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресЭлПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиУстанавливатьКонечноеСостояниеУПервичныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиУдалятьОбработанныеИПомеченныеНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтсрочкиУдаленияУстаревшихДокументов</name>
    <type>
      <types>EnumRef.ПериодыОтсрочкиУдаленияУстаревшихДокументов</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПорогНоменклатурыДляГрупповогоСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПрикреплятьИзображения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиУдалятьНеобработанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтсрочкиУдаленияНеобработанныхДокументов</name>
    <type>
      <types>EnumRef.ПериодыОтсрочкиУдаленияУстаревшихДокументов</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиРегистрироватьЧеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

uhnp/src/Enums/ВариантыСохраненияСоответствийБРД/ВариантыСохраненияСоответствийБРД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыСохраненияСоответствийБРД</name>
  <enumValues>
    <name>СохранятьАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>ЗадаватьВопрос</name>
  </enumValues>
  <enumValues>
    <name>НеСохранятьИНеЗадаватьВопрос</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПериодыОтсрочкиУдаленияУстаревшихДокументов/ПериодыОтсрочкиУдаленияУстаревшихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодыОтсрочкиУдаленияУстаревшихДокументов</name>
  <enumValues>
    <name>Через1День</name>
  </enumValues>
  <enumValues>
    <name>Через1Неделю</name>
  </enumValues>
  <enumValues>
    <name>Через1Месяц</name>
  </enumValues>
  <enumValues>
    <name>Через3Месяца</name>
  </enumValues>
  <enumValues>
    <name>Через6Месяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/ОбщиеНастройкиРаспознаваниеДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекущиеНастройки() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВариантСохраненияСоответствий", Перечисления.ВариантыСохраненияСоответствийБРД.СохранятьАвтоматически);
	Результат.Вставить("ОткрыватьНовыеЭлементыСправочниковПослеСоздания", Ложь);
	
	Результат.Вставить("ФормаОбработчикаПоказыватьИзображенияВШапке", Ложь);
	
	Результат.Вставить("СкладПоУмолчанию");
	Результат.Вставить("АдресЭлПочты", "");
	
	Результат.Вставить("НеПрикреплятьИзображения", Ложь);
	Результат.Вставить("ПомечатьДокументОбработаннымПриНайденномВБазе", Истина);
	Результат.Вставить("ПриОбнаруженииДокументаПрикреплятьИзображениеАвтоматически", Ложь);
	Результат.Вставить("АвтоматическиУстанавливатьКонечноеСостояниеУПервичныхДокументов", Ложь);
	Результат.Вставить("СоздаватьСчетФактуруПриСозданииОснования", Ложь);
	
	Результат.Вставить("АвтоматическиУдалятьОбработанныеИПомеченныеНаУдаление", Истина);
	Результат.Вставить("ПериодОтсрочкиУдаленияУстаревшихДокументов", Перечисления.ПериодыОтсрочкиУдаленияУстаревшихДокументов.Через1Неделю);
	
	Результат.Вставить("АвтоматическиУдалятьНеобработанные", Истина);
	Результат.Вставить("ПериодОтсрочкиУдаленияНеобработанныхДокументов", Перечисления.ПериодыОтсрочкиУдаленияУстаревшихДокументов.Через3Месяца);
	
	Результат.Вставить("АвтоматическиРегистрироватьЧеки", Истина);
	
	// Извлечение сохраненных настроек
	
	ИзвлеченныеНастройки = ОбщегоНазначения.СкопироватьРекурсивно(Результат);
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(ИзвлеченныеНастройки, МенеджерЗаписи);
	КонецЕсли;

	// Применение настроек, отличающихся от значений по-умолчанию
	// Если настройка была добавлена, то при обновлении БД ресурс будет иметь незаполненное значение
	// Потому после чтения следует незаполненные настроки привести к значениям по-умолчанию
	// Или же перенести к настройкам по-умолчанию заполненные прочитанные настройки.
	
	Для Каждого Настройка Из ИзвлеченныеНастройки Цикл
		
		Если ЗначениеЗаполнено(Настройка.Значение) Тогда
			Результат[Настройка.Ключ] = Настройка.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ФиксированныеДанные(Результат);
	
КонецФункции

Процедура УстановитьАвтоматическиУдалятьОбработанныеИПомеченныеНаУдаление(Значение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.АвтоматическиУдалятьОбработанныеИПомеченныеНаУдаление = Значение;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
